# Пользователь вводит 3 числа, сказать сколько из них положительных и сколько отрицательных
number1 = int(input('enter the number: '))
number2 = int(input('Enter the number: '))
number3 = int(input('Enter the number: '))
print((number1>0) + (number2>0) + (number3>0))
print((number1<0) + (number2<0) + (number3<0))
